#'+':两个对象相加
#两个数字相加
a = 7+8
print (a)

#两个字符串相加
b = 'steam' + 'Gpang'
print (b)

#'-':取一个数字的相反数或者实现两个数字相减
a = -7
a
b=-(-8)
print (b)

c = 19-1
print (c)

#'*':两个数相乘或者字符串重复
a = 4*7
print (a)

b = 'hello'*7
print (b)

#'/':两个数字相除
a = 5/2
print(int(a)) #向上取整

b = 7.0/2
print(b)
c = 7/2.0
print(c)

#'**':求幂运算
a = 2**3  #2*2*2
print(a)

#'<':小于符号,返回一个布尔值
a = 3<7
print(a)

b = 3<3
print(b)

#'>':小于符号,返回一个布尔值
a = 3>7
print(a)

b = 3>3
print(b)

#'!=':不等于符号，返回布尔值
a = 2 != 3
print(a)

#'//':除法运算，然后返回其商的整数部分，舍掉余数
a = 10//3
print(a)

#'%':除法运算，返回余数，舍掉商
a = 10%3
print(a)

b = 10%1 #没有余数的时候返回什么
print(b)

a = 10/3  #a为商的整数部分
b = 10%3 #b为余数
c = 3*a+b #c为除数乘以商的整数部分加上余数，c就是被除数
print (c)

#'&':按位与运算,所谓的按位是指一个数字转化为二进制，然后这些二进制的数按位来进行与运算
a = 7&18 #结果是2
print (a)
#7的二进制：111 自动补全八位：00000111
#18的二进制:10010 补全:00010010
# 00000111
# 00010010 按位进行与运算
# 00000010 转化为十进制 为2 相同的1得1

#'|':按位的或运算
a = 7|18
#00000111
#00010010
#00010111 10111转为十进制：23 相同的1 或 1与0 得1
print(a)

#'^':按位的异或
a = 7^18
print (a)
#00000111
#00010010
#00010101 101010十进制:21 1与0得1

#'~':按位翻转 ~x = -(x+1)
a = ~18 #~18 = -(18+1)
print (a)

#'<<':左移
#比如18的左移 二进制为00010010左移 -> 00100100 得36 左移n个单位 相当于乘2的n次方
a = 18<<1 #'<<'后面的数是移几位
print(a)

b = 3<<3
print(b)

#'>>'：右移 右移n个相当于除以2的n次方
a = 18>>1
print(a)
b = 18>>2
print(b)

#'<=':小于或等于，返回布尔值
a =3 <=3
print(a)

#'>=':大于或等于，返回布尔值
a =3 >=3
print(a)

#'==':比较两个对象是否相等
a = 12 == 13
print(a)

#'not':逻辑非
a = True
b = not a
print(b)

c = False
print(not c)

#'and':逻辑与
a = True
b = True
print(a and b)#True
c = False
print(a and c)#False

#'or':逻辑或
a = True
b = True
print(a or b)#True
c = False
print(a or c)#True
